# NewElementTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTypeDuplicatedEventArgs..::..NewElementTypeId Property
ElementTypeDuplicatedEventArgs Class See Also
---
The id of the newly duplicated ElementType.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId NewElementTypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewElementTypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ NewElementTypeId {
	ElementId^ get ();
}
```

# See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace